app/Controllers/admin.php

SELECT *
FROM `buku`
SELECT SUM(`dipinjam`) AS `dipinjam`
FROM `buku`
SELECT *
FROM `user`
WHERE `id` = '2'
 LIMIT 1
SELECT COUNT(*) AS `numrows` FROM `user`
---
    public function dashboard()
    {
        if (!session()->has('user_id')) {
            session()->setFlashdata('error', 'Akses ditolak. Anda belum login!!');
            return redirect()->to('/auth');
        }

        $user = new userModels();
        $buku = new bukumodels();
        $getuser = $user->findAll();
        $getbuku = $buku->findAll();
        $dateAndTime = date('Y', $getuser[0]['tanggal_input']);
        $totalStock = $buku->selectSum('stok')->findAll();
        $totalbooking = $buku->selectSum('dibooking')->findAll();
        $totalpinjam = $buku->selectSum('dipinjam')->findAll();
        $jumlahtotalpinjam = $totalpinjam[0]['dipinjam'];
        $jumlahtotalbooking = $totalbooking[0]['dibooking'];
        $jumlahtotalstock = $totalStock[0]['stok'];
        $getoneuser = $user->where('id', session()->get('user_id'))->first();
        $data = [
            'judul' => 'Dashboard',
            'user' => $user->countAll(),
            'stok' => $jumlahtotalstock,
            'pinjam' => $jumlahtotalpinjam,
            'booking' => $jumlahtotalbooking,
            'dateAndTime' => $dateAndTime,
            'anggota' => $getoneuser,
            'anggotaAll' => $getuser,
            'buku' => $getbuku
        ];