app/Controllers/buku.php

SELECT *
FROM `kategori`
---
    public function find()
    {
        $buku = new bukumodels();
        $kategori = new KategoriModel();
        $user = new userModels();
        $res = $user->where('id', session()->get('user_id'))->first();
        $result_buku = $buku->findAll();
        $result_kategori = $kategori->findAll();

SELECT *
FROM `kategori`
WHERE `id_kategori` = '12'
 LIMIT 1
SELECT *
FROM `kategori`
---
    public function formbukuubah($id = null) {
        $buku = new bukumodels();
        $kategori = new KategoriModel();
        $user = new userModels();
        $res = $user->where('id', session()->get('user_id'))->first();
        $result_buku = $buku->where('id', $id)->first();
        $join_kategori = $kategori->where('id_kategori', $result_buku['id_kategori'])->first();
        $result_kategori = $kategori->findAll();

UPDATE `buku` SET `judul_buku` = 'luffy d monkey', `id_kategori` = '7', `pengarang` = 'odasan', `penerbit` = 'oda senpai', `tahun_terbit` = '2009', `isbn` = '45838754', `stok` = '10'
WHERE `buku`.`id` IN ('27')
UPDATE `buku` SET `judul_buku` = 'luffy d monkey', `id_kategori` = '12', `pengarang` = 'odasan', `penerbit` = 'oda senpai', `tahun_terbit` = '2009', `isbn` = '45838754', `stok` = '10'
WHERE `buku`.`id` IN ('27')
---
    public function updateBuku($id = null)
    {
        $buku = new bukumodels();
        $user = new userModels();
        $res = $user->where('id', session()->get('user_id'))->first();
        $kategori_name = $this->request->getPost();
        $getimage = $this->request->getFile('image');
        $old_data_buku = $buku->where('id', $kategori_name['id'])->first();

        if ($getimage->getName() == $old_data_buku['image']) {
            $buku->save([
                'id' => $kategori_name['id'],
                'judul_buku' => $kategori_name['judul_buku'],
                'id_kategori' => $kategori_name["id_kategori"],
                'pengarang' => $kategori_name["pengarang"],
                'penerbit' => $kategori_name["penerbit"],
                'tahun_terbit' => $kategori_name["tahun"],
                'isbn' => $kategori_name["isbn"],
                'stok' => $kategori_name["stok"],
            ]);
            return redirect()->to('/buku');
        }

        if (empty($getimage->getName())) {
            $buku->save([
                'id' => $kategori_name['id'],
                'judul_buku' => $kategori_name['judul_buku'],
                'id_kategori' => $kategori_name["id_kategori"],
                'pengarang' => $kategori_name["pengarang"],
                'penerbit' => $kategori_name["penerbit"],
                'tahun_terbit' => $kategori_name["tahun"],
                'isbn' => $kategori_name["isbn"],
                'stok' => $kategori_name["stok"],
            ]);

UPDATE `buku` SET `judul_buku` = 'luffy d monkey', `id_kategori` = '7', `pengarang` = 'odasan', `penerbit` = 'oda senpai', `tahun_terbit` = '2009', `isbn` = '45838754', `stok` = '10', `image` = 'ayang2.png'
WHERE `buku`.`id` IN ('27')
---
                return redirect()->to('/buku');
            }
        } else {
            $buku->save([
                'id' => $kategori_name['id'],
                'judul_buku' => $kategori_name['judul_buku'],
                'id_kategori' => $kategori_name["id_kategori"],
                'pengarang' => $kategori_name["pengarang"],
                'penerbit' => $kategori_name["penerbit"],
                'tahun_terbit' => $kategori_name["tahun"],
                'isbn' => $kategori_name["isbn"],
                'stok' => $kategori_name["stok"],
                'image' => $getimage->getName()
            ]);