app/Controllers/kategori2.php

SELECT *
FROM `kategori`
---
    public function find()
    {
        if (!session()->has('user_id')) {
            session()->setFlashdata('error', 'Akses ditolak. Anda belum login!!');
            return redirect()->to('/auth');
        }

        $user = new userModels();
        $res = $user->where('id', session()->get('user_id'))->first();

        $kategori = new KategoriModel();
        $result = $kategori->findAll();

SELECT *
FROM `kategori`
WHERE `id_kategori` = '5'
 LIMIT 1
---
    public function formUbahKategori($id = null) {
        $kategori = new KategoriModel();
        $user = new userModels();
        $res = $user->where('id', session()->get('user_id'))->first();
        $search = $kategori->where("id_kategori", $id)->first();